app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @item = @order.order_items.new(item_params)
    @order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["order_id", 1], ["created_at", "2017-12-08 20:05:53.126999"], ["updated_at", "2017-12-08 20:05:53.126999"]]
INSERT INTO "orders" ("total_price", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["total_price", "83.0"], ["created_at", "2017-12-08 20:05:53.125409"], ["updated_at", "2017-12-08 20:05:53.125409"]]

  def destroy
    @order = current_order
    @item = @order.order_items.find(params[:id])
    @item.destroy
    @order.save
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", "0"], ["updated_at", "2017-12-08 20:06:00.700666"], ["id", 1]]